@antonbabenko @PascalBourdier 
The following  resource at https://github.com/terraform-aws-modules/terraform-aws-eks/blob/master/examples/launch_templates_with_managed_node_groups/disk_encryption_policy.tf#L2
 is always re-created when I apply terraform apply (terraform 1.0)
```
 resource "aws_iam_service_linked_role" "autoscaling" {
    aws_service_name = "autoscaling.amazonaws.com"
    description      = "Default Service-Linked Role enables access to AWS Services and Resources used or managed by Auto Scaling"
     custom_suffix    = "lt_with_managed_node_groups" # the full name is "AWSServiceRoleForAutoScaling_lt_with_managed_node_groups" < 64 characters
   } 
```

see the result.
```

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_service_linked_role.autoscaling must be replaced
-/+ resource "aws_iam_service_linked_role" "autoscaling" {
      ~ arn              = "arn:aws:iam::id:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling_lt_with_managed_node_groups" -> (known after apply)
      ~ create_date      = "2021-10-04T19:33:58Z" -> (known after apply)
      + custom_suffix    = "lt_with_managed_node_groups" # forces replacement
      ~ id               = "arn:aws:iam::id:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling_lt_with_managed_node_groups" -> (known after apply)
      ~ name             = "AWSServiceRoleForAutoScaling_lt_with_managed_node_groups" -> (known after apply)
      ~ path             = "/aws-service-role/autoscaling.amazonaws.com/" -> (known after apply)
      ~ unique_id        = "AROATPZ442RUJ3BUOZH6F" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_iam_service_linked_role.autoscaling: Destroying... [id=arn:aws:iam::id:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling_lt_with_managed_node_groups]
aws_iam_service_linked_role.autoscaling: Still destroying... [id=arn:aws:iam::id:role/aws-serv...utoScaling_lt_with_managed_node_groups, 10s elapsed]
aws_iam_service_linked_role.autoscaling: Destruction complete after 12s
aws_iam_service_linked_role.autoscaling: Creating...
aws_iam_service_linked_role.autoscaling: Creation complete after 1s [id=arn:aws:iam::id:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling_lt_with_managed_node_groups]
Releasing state lock. This may take a few moments...
```

But it works fine if I remove `custom_suffix` or If I add 
```
 lifecycle {
    ignore_changes = ["custom_suffix"]
  }
  ```